Repository: xfce-mirror/xfce4-fsguard-plugin
Catalog: po/*.po
Languages: ro

source: Unable to find an appropriate application to open the mount point
ro: Nu s-a putut găsi o aplicație adecvată pentru a deschide punctul de montare

source: could not check mountpoint %s, please check your config
ro: nu s-a putut verifica punctul de montare %s, vă rugăm să verificați configurația

source: %.2f GB
ro: %.2f Go

source: %.0f MB
ro: %.0f Mo

source: %s/%s space left on %s (%s)
ro: %s/%s spațiu rămas pe %s (%s)

source: %s/%s space left on %s
ro: %s/%s spațiu rămas pe %s

source: Only %s space left on %s (%s)!
ro: A mai rămas doar %s de spațiu pe %s (%s)!

source: Only %s space left on %s!
ro: A mai rămas doar %s de spațiu pe %s!

source: Free Space Checker
ro: Verificator de spațiu liber

source: _Close
ro: În_chide

source: Configuration
ro: Configurare

source: Mount point
ro: Punct de montare

source: Warning limit (%)
ro: Limită atenționare (%)

source: Urgent limit (%)
ro: Limită urgență (%)

source: User Interface
ro: Interfața cu utilizatorul

source: Name
ro: Nume

source: Display size
ro: Afișează dimensiunea

source: Display meter
ro: Afișează contorul

source: Display button
ro: Afișează butonul

source: Monitor free disk space
ro: Monitorizează spațiul liber de pe disc
